"""Напишите программу, в которой с использованием текстовых литералов
(например, используя текстовый литерал, заключенный в тройные кавычки)
символом «звездочка» * в области вывода отображается фраза "Hello Python"."""

txt = """
*   * ***** *     *     *****   ***** *   * ***** *   * ***** *   *
*   * *     *     *     *   *   *   * *   *   *   *   * *   * **  *
***** ***** *     *     *   *   ***** *****   *   ***** *   * * * *
*   * *     *     *     *   *   *         *   *   *   * *   * *  **
*   * ***** ***** ***** *****   *     *****   *   *   * ***** *   *
"""

print(txt)
